In [1]:
import pandas as pd

In [4]:
data = [10,20,30,40,50]
series = pd.Series(data)
series

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [7]:
index = [1,2,3]
data = {"a":1,"b":2,"c":3}
pd.Series(data)
pd.Series(data,index=index)

1   NaN
2   NaN
3   NaN
dtype: float64

In [10]:
data = {
    "Name":["Tirth","Krish","Jack","Enna"],
    "Age":[22,19,25,21],
    "City":["New York","Florida","Mexico","France"]
}
df = pd.DataFrame(data)
df

    Name  Age      City
0  Tirth   22  New York
1  Krish   19   Florida
2   Jack   25    Mexico
3   Enna   21    France

In [11]:
df['Name']

0    Tirth
1    Krish
2     Jack
3     Enna
Name: Name, dtype: object

In [16]:
df.loc[0]

Name       Tirth
Age           22
City    New York
Name: 0, dtype: object

In [17]:
df.at[2,"City"]

'Mexico'

In [21]:
df['Salary'] = [50000,65000,73000,500]
df

    Name  Age      City  Salary
0  Tirth   22  New York   50000
1  Krish   19   Florida   65000
2   Jack   25    Mexico   73000
3   Enna   21    France     500

In [23]:
df.drop("Salary",axis=1,inplace=True)  # axis=1 -> Column # inplace=1 -> Change the original data